{"pageProps":{"postData":{"title":"Keep your JavaScript repository clean","date":"2022-04-08T00:00:00.000Z","description":"How we can clean up the repository root directory from config files like .eslintrc.js, tsconfig.json, jest.config.js and others.","tags":["tools","node","npm"],"slug":"keep-your-java-script-repository-clean","contentHtml":"<p>As your JavaScript project grows, you start adding more tools and settings that will improve the development experience.</p>\n<p>Nowadays, tools like eslint, husky, and tests are essential for any project.</p>\n<p>The problem is that most of these tools require a config file at the root of your project/repo.\nAfter some time, the root directory is full of config files, and it's a bit intimidating when you open it in the git hub.</p>\n<p>One elegant solution I found in <a href=\"https://github.com/remirror/remirror\">remirror</a> repo.\nThere all config files that should stay in the root of the project are actually in the <code>./support/root/</code> directory,\nand they are locally symlinked when setting up the project.</p>\n<p>Inspired by their approach I created <a href=\"https://github.com/strdr4605/symlink-config\">symlink-config</a>, which helps to migrate your project to this approach.</p>\n<p>Here is how repo looks on Github before and after:</p>\n<table>\n  <thead>\n  <tr>\n    <th>Default</th>\n    <th>With symlink-config</th>\n  </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td><img src=\"/root-config-files-demo.png\" alt=\"root config files demo\"></td>\n      <td style=\"display: flex;\"><img src=\"/root-symlink-config-files-demo.png\" alt=\"root symlink config files demo\"></td>\n    </tr>\n  </tbody>\n</table>\n<p>This demo has only 5 configs in the root, but imagine adding more tools, like tsconfig.json, jest.config.js, and others.</p>\n<p>When exploring the project locally,\nall these files will be in the root but being just a symlink file they will differ from the rest of the files and you may skip them visually.</p>\n<p>In the end, I think this tool is useful for big open source projects with a lot of config files, as it cleans up the entry point of the project (the repo root) and makes it more appealing to users.</p>\n<p>Check out <a href=\"https://github.com/strdr4605/symlink-config\"><strong>symlink-config</strong></a>, and let me know your opinion!</p>\n"},"_superjson":{"values":{"postData.date":["Date"]}}},"__N_SSG":true}