{"pageProps":{"postData":{"title":"9 Ways to Win a Hackathon... Without Coming in First Place","slug":"how-to-win-a-hackathon","date":"2021-05-25T00:00:00.000Z","starred":true,"description":"To win first place at a hackathon, you need to combine multiple components... and that's not always possible. Here's how to make the most of your next hackathon without coming in 'first place'.","tags":["learning","career","hackathons"],"contentHtml":"<blockquote>\n<p>Originally posted at <a href=\"https://cult.honeypot.io/reads/how-to-win-a-hackathon\">https://cult.honeypot.io/reads/how-to-win-a-hackathon</a></p>\n<blockquote>\n<p>See discussion on <a href=\"https://news.ycombinator.com/item?id=27831250\">HackerNews</a></p>\n</blockquote>\n</blockquote>\n<p>From my experience at hackathons, I understand that it’s not just about winning first place. You participate to learn something new, make connections and have fun.</p>\n<p>During my first hackathons, I was really focused on winning and didn’t see all the other benefits of going to a hackathon. When I didn’t win, I was so upset that I almost wanted to forget about the whole event.</p>\n<p>Over time I noticed that hackathons always attract multiple types of people, with different skill sets. Many of them are participating to learn something new or to train specific skills, like programming, pitching, design or business skills.</p>\n<p>To actually win first place at a hackathon, you need to combine multiple components. You should have a good team of people with different skill sets. You need a good idea and even better execution. You need programmers, designers, speakers, researchers and people with good communication skills.</p>\n<p>Of course, you don’t always (or usually) have all those things. Maybe your team isn't perfect or the hackathon topic is particularly complex, making it hard to come up with a good concept. After attending <a href=\"https://strdr4605.github.io/what-i-learned-from-35-hackathons\">over 40 hackathons</a>, I’ve started to understand that, instead of focusing on winning first place, I can achieve a lot more by focussing on winning new skills and helping others. Treat winning first place as a bonus--the cherry on top of all the new things that you already learned.</p>\n<p>Now let’s see what you should do to acquire skills for your needs and how to win without coming in first place.</p>\n<h2>1. Win as a first-time newbie</h2>\n<p>Maybe it’s your first or second hackathon and you don’t know what you should do or how your skills may help the team. Don’t worry. Take your time to learn how hackathons work, its key components and what skills are required from the participants. Don’t wait for someone to give you tasks. Ask for them, propose ideas, brainstorm with your team members. Help teammates on their tasks, practice pair programming or review the design and suggest ideas. Discuss with mentors and ask for advice not only about the hackathon but also personal/professional topics. See what tools other participants use, like programming languages, code editors, design apps, planning and collaborative tools. Ask why they prefer these tools over others.</p>\n<p>The action list:</p>\n<ul>\n<li>Ask for tasks</li>\n<li>Help your teammates</li>\n<li>Speak with mentors</li>\n<li>Learn new tools</li>\n<li>Have fun</li>\n</ul>\n<h2>2. Win as a programmer</h2>\n<p>Apparently you’re already familiar with some programming languages, tools and frameworks to build web/mobile apps. You can use the hackathon to showcase your coding skills and learn new languages and frameworks. If you already know the backend, try doing the prototype in another language or framework. Or for this hackathon, try switching to frontend. Focus on learning specific libraries. Watch tutorials, read articles on best practice. Use as many features as possible from the library to understand pros and cons of using it, see use cases and alternatives.</p>\n<p>The action list:</p>\n<ul>\n<li>Learn a new language/framework/library</li>\n<li>Try a different programming domain (gaming/backend/frontend/machine learning)</li>\n<li>Discuss best practice with other programmers</li>\n<li>Teach newbie programmers</li>\n<li>Have fun</li>\n</ul>\n<h2>3. Win as a designer</h2>\n<p>At most hackathons, there isn’t time for complex coding solutions. In fact, sometimes the most impressive designs win without any backend implementation. As a designer, you should understand that you’re able to save your team with an amazing UI and UX. Moreover, don’t forget to focus on learning new things. Try doing a mobile/desktop/10-foot design for your app. You may also try different tools or design systems. Use a prototyping tool that will simulate the behavior of a real app.</p>\n<p>The action list:</p>\n<ul>\n<li>Make several sketches for your application</li>\n<li>Try using tools other than those used before</li>\n<li>Consult with your team</li>\n<li>Have fun</li>\n</ul>\n<h2>4. Win as a speaker</h2>\n<p>Each team has to delegate a person who will introduce their final product to the public. Usually, the speaker has to start preparing the presentation from the beginning of the hackathon, because judges will only see what the speaker presents. So, you have to convince them all that your solution is the best. Remember that a simple and clear demonstration is the key!</p>\n<p>To get the maximum benefits of a hackathon as a speaker, you can exercise expressing your ideas in front of your teammates, where you can pay attention to your posture, gestures, and how you deliver your speech. Going through these steps, you will become more confident and convincing, qualities which are crucial for a great speaker.</p>\n<p>The action list:</p>\n<ul>\n<li>Plan your presentation flow</li>\n<li>Try expressing your solution clearly</li>\n<li>Rehearse in front of your teammates</li>\n<li>Have fun</li>\n</ul>\n<h2>5. Win as a manager</h2>\n<p>Being a manager at a hackathon, you have to adapt to short term projects.There are several things you can do to deliver an MVP on time. You can distribute the tasks to your team members depending on their capacities, so make sure everyone is involved and does their best to achieve the common goal. Try setting up meetings every 5-6 hours to discuss with your team about updates and next steps. Also, a good practice is to divide tasks into subtasks to be able to monitor the process of implementation. Ensure that everyone understands their duties and performs well.</p>\n<p>The action list:</p>\n<ul>\n<li>Setup regular meetings with your team</li>\n<li>Practise time management</li>\n<li>Try dividing the responsibilities into subtasks</li>\n<li>Have fun</li>\n</ul>\n<h2>6. Win as a mentor</h2>\n<p>A hackathon mentor is like the professor for all participants. Your role as a mentor is to arouse enthusiasm and demonstrate your willingness to help. Additionally, you can strengthen your knowledge by teaching others things you’re good at. Also, you could recommend the newest tools and frameworks you have already worked with. Furthermore, you can share particular situations you’ve faced and how you managed to solve them. Try explaining using straightforward methods and make sure everyone understands what you want to say. You can even prepare a presentation to cover the main topics of the hackathon, including some hacks and tricks.</p>\n<p>The action list:</p>\n<ul>\n<li>Prepare a presentation covering hackathon topic</li>\n<li>Approach each team to see everybody’s progress</li>\n<li>Propose your help</li>\n<li>Share your experience</li>\n<li>Have fun</li>\n</ul>\n<h2>7. Win as a host</h2>\n<p>The host has the most significant duties and responsibilities during a hackathon. As organizers, you can make this event go well for people to remain with positive emotions. You could organize some extra activities for fun, for instance, interactive or board games, maybe quizzes or challenges. Also, try informing everyone about each phase of the hackathon so everybody could manage their time.</p>\n<p>The action list:</p>\n<ul>\n<li>Prepare a plan to arrange each phase of the event on time</li>\n<li>Make sure everyone is aware of hackathon’s schedule</li>\n<li>Announce when the meals are ready</li>\n<li>Try making photos/videos to capture the most colourful moments</li>\n<li>Have fun</li>\n</ul>\n<h2>8. Win as a volunteer</h2>\n<p>As a volunteer, you get to see the inside process of how a hackathon is organized. You may get involved in searching for partners and funds, mentors and speakers. As a suggestion, try engaging yourself in as many activities as possible to find out what you like to do the most. You may try your management skills to properly estimate the resources, or you can demonstrate your great communication skills when speaking with sponsors and partners.</p>\n<p>The action list:</p>\n<ul>\n<li>Try several roles and activities</li>\n<li>Make connections among participants and organisers</li>\n<li>Widen your circle of friends</li>\n<li>Have fun</li>\n</ul>\n<h2>9. Win as a sponsoring company</h2>\n<p>IT Companies are very supportive when it comes about sponsoring hackathons. This is a win-win collaboration for both companies and participants. Individuals familiarize themselves with the culture of these companies and may apply for their jobs and internships. Companies, on the other hand, may propose several job offers to some talented and diligent candidates. Also, companies may offer symbolic prizes to all participants to make everyone feel rewarded.</p>\n<p>The action list:</p>\n<ul>\n<li>Give attention to every team</li>\n<li>Invite participants to interviews</li>\n<li>Promote your company’s values</li>\n<li>Organise workshops regarding hackathon topic</li>\n<li>Have fun</li>\n</ul>\n"},"_superjson":{"values":{"postData.date":["Date"]}}},"__N_SSG":true}