{"pageProps":{"postData":{"title":"My first open-source project","date":"2019-05-29T00:00:00.000Z","tags":["open-source"],"slug":"my-first-open-source-project","contentHtml":"<blockquote>\n<p>Originally posted on <a href=\"https://dev.to/strdr4605/my-first-open-source-project-35ka\">dev.to</a>.</p>\n</blockquote>\n<h2>Preface</h2>\n<p>When I started University I participated in my first Hackathon. And from that day I understood that I really enjoy building things and contributing together with other people. Participating at hackathons I primordially used <em>JavaScript</em> as it is a perfect language to develop fast prototypes. I used a lot of open-source libraries and tools and at some point, I wanted to also contribute to any project as I thought that contributing will help me to raise my developing skills.</p>\n<p>So occasionally I was trying to find a project on <em>GitHub</em> there I can contribute. And I faced the problem that I think everyone who is trying to contribute had. The problem is finding the right project and the issue that you can solve. I was surfing sites like <a href=\"https://up-for-grabs.net/\">https://up-for-grabs.net/</a> and others searching for a <em>JavaScript</em> library or package where I can contribute. In most cases even if the issues were labeled with <em>good first issue</em> or <em>first-timers-only</em> they involved a deep understanding of the project. And in cases where I found something that I can implement other contributors were already working on the issue.</p>\n<p>In the end, I contributed to a project by updating the README and at that time it was an achievement for me :tada:. But I wanted to contribute with code so my first code contribution was (as I suggesting) converting the SVG clock logo to a real-time clock for <a href=\"http://rebble.io/\">http://rebble.io/</a>. It was my next achievement. But I was still looking at something interesting to contribute. But everything changed when I created my first npm package.</p>\n<h2>mOcKiNgCaSe</h2>\n<p>The idea of the package came to me after explaining to someone the differences between <code>camelCase</code>, <code>snake_case</code>, <code>kebab-case</code>. I remembered the <a href=\"https://knowyourmeme.com/memes/mocking-spongebob\">mocking spongebob</a> meme and did a quick research to see if there isn't such package already.</p>\n<p>The purpose of the package is to change a <code>string</code> to <code>sTrInG</code>. I thought about naming it <em><strong>spongebobcase</strong></em> but in the end, decided to stick with <em><strong>mockingcase</strong></em> as it sounds better(in my and friends opinions). Later I found an article on Wikipedia <a href=\"https://en.wikipedia.org/wiki/Studly_caps\">Studly caps</a> which explains about this case.\nSo in one or two days I already published the first version of the <a href=\"https://www.npmjs.com/package/@strdr4605/mockingcase\">mOcKiNgCaSe</a> on npm. Even at that point, I learned a lot about <strong><a href=\"https://semver.org/\">semantic versioning</a></strong> and publishing npm packages.</p>\n<p>Quickly after I made a post on <a href=\"https://www.reddit.com/r/javascript/comments/9ytkno/my_first_npm_package/\">reddit.com/r/javascript/</a> to see people opinions. Some of them reproached me because I made a useless package, some praised me because I learned something new and others just liked the idea of the package itself and it even received some <a href=\"https://github.com/strdr4605/mockingcase/stargazers\">🌟 on GitHub</a>. People who liked the package started contributing to it, like adding unit tests and optimizing the converting function.\nI decided that I will add more features even if it looked over-engineering for such kind of package. I thought about some features that can be added and opened the issues in the <a href=\"https://github.com/strdr4605/mockingcase/issues?q=is%3Aissue+is%3Aclosed+label%3A%22help+wanted%22\">repo</a> and added the project on the <a href=\"https://up-for-grabs.net/\">https://up-for-grabs.net/</a> so others can contribute too.</p>\n<p>As the package itself and the features that should be implemented aren't so difficult, this open-source project is very beginner friendly. At the moment the project has already 11 contributors who did a lot of good work and really improved the package. Contributing to this projects teaches you about software versioning, unit testing, continuous integration, declaration files for <em>TypeScript</em>, documentation but also a lot of interesting things about <em>JavaScript</em> and development itself. I even created <a href=\"https://redex.github.io/package/unpublished/strdr4605/bs-mockingcase/\">mockingcase bindings</a> for <a href=\"https://reasonml.github.io/\">ReasonML</a>.</p>\n<blockquote>\n<p>If you are interested you can check the documentation of the package on GitHub <a href=\"https://github.com/strdr4605/mockingcase\">mockingcase</a>.</p>\n</blockquote>\n<p>You decide if you like the package and if it is somehow useful in your point of view. But as I think it can be used as a joke to display funny messages or errors to users. The important feature (in my opinion) that will raise the popularity of this package is <a href=\"https://github.com/strdr4605/mockingcase/issues/37\">changes all text on an HTML page</a> which will let developers use this package as a 1st April joke for their web application.</p>\n<h2>Conclusion</h2>\n<p>Even if it may look like a useless project to someone, I learned a lot during the development of it and also gave others beginner contributors a chance to make their first contribution to open-source. So I encourage you to start contributing to open-source as it is an amazing experience.</p>\n"},"_superjson":{"values":{"postData.date":["Date"]}}},"__N_SSG":true}